In [2]:
import pandas as pd

In [4]:
data = {'Name': ['Arpit','Manish','Joy','Rohit','Virat','Shreya'],
        'Age': [30, 35, 37, 33, 34, 30],
        'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
        'Designation': ['Engineer','Artist','Painter','Singer','Designer','Dancer']}




df = pd.DataFrame(data)
df

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

In [ ]:
# Q1. Display the name and age of the employees where salary is less than mean salary

In [5]:
df.loc[ df['Salary'] < df['Salary'].mean(), ['Name','Age'] ]

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [6]:
## Richa 
mean = df['Salary'].mean()
#df['Name'][df['Salary']>mean]
df[['Age','Name']][df['Salary']<mean]

   Age    Name
1   35  Manish
2   37     Joy
4   34   Virat
5   30  Shreya

In [8]:
import numpy as np

In [9]:
## Sharanya
df.loc[(df['Salary'] < np.mean(df['Salary'])),['Name','Age']]

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [11]:
#Aryan 
import numpy as np
mn=np.mean(df.Salary)
print(df.Name[df.Salary<mn].values,df.Age[df.Salary<mn].values)

['Manish' 'Joy' 'Virat' 'Shreya'] [35 37 34 30]

In [12]:
#Aditya 
a = df['Salary'].mean()
c = df['Name'].count()
for i in range(c):
    if(df['Salary'][i]<a):
        print(df['Name'][i])
        print(df['Age'][i])

Manish
35
Joy
37
Virat
34
Shreya
30

In [13]:
df

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

In [ ]:
#Q2. Display the name and age of the employees where salary is >100000 & Age is less than 40

In [ ]:
# Sharanya 
df.loc[(df['Salary'] > 100000) & (df['Age'] < 40),['Name','Age']]